app/Controllers/Admin/JadwalController.php

    public function show($id = null)
    {
        $result = $this->jadwalModel
            ->join('tb_kelas', 'tb_jadwal.id_kelas = tb_kelas.id_kelas', 'LEFT')
            ->join('tb_guru', 'tb_jadwal.id_guru = tb_guru.id_guru', 'LEFT')
            ->join('tb_matpel', 'tb_jadwal.id_matpel = tb_matpel.id_matpel', 'LEFT')
            ->join('tb_jurusan', 'tb_kelas.id_jurusan = tb_jurusan.id', 'LEFT')
            ->findAll();
---
SELECT *
FROM `tb_jadwal`
LEFT JOIN `tb_kelas` ON `tb_jadwal`.`id_kelas` = `tb_kelas`.`id_kelas`
LEFT JOIN `tb_guru` ON `tb_jadwal`.`id_guru` = `tb_guru`.`id_guru`
LEFT JOIN `tb_matpel` ON `tb_jadwal`.`id_matpel` = `tb_matpel`.`id_matpel`
LEFT JOIN `tb_jurusan` ON `tb_kelas`.`id_jurusan` = `tb_jurusan`.`id`

    public function new()
    {
        $guru = $this->guruModel->findAll();
        $kelas = $this->kelasModel
            ->join('tb_jurusan', 'tb_kelas.id_jurusan = tb_jurusan.id', 'LEFT')
            ->findAll();
        $matpel = $this->matpelModel->findAll();
---
SELECT *
FROM `tb_guru`
SELECT *
FROM `tb_kelas`
LEFT JOIN `tb_jurusan` ON `tb_kelas`.`id_jurusan` = `tb_jurusan`.`id`
WHERE `tb_kelas`.`deleted_at` IS NULL
SELECT *
FROM `tb_matpel`