app/Controllers/Admin/MatpelController.php

    public function show($id = null)
    {
        $result = $this->matpelModel->findAll();
---
SELECT *
FROM `tb_matpel`